app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "vertical_id", "state", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test 1010"], ["vertical_id", 1], ["state", 1], ["created_at", "2019-11-30 17:27:03.207419"], ["updated_at", "2019-11-30 17:27:03.207419"]]
---
  def create
    begin
      category = @vertical.categories.create! category_params

UPDATE "categories" SET "name" = $1, "state" = $2, "updated_at" = $3 WHERE "categories"."id" = $4  [["name", "test category"], ["state", 1], ["updated_at", "2019-11-30 16:51:30.838424"], ["id", 1]]
---
  def update
    begin
      get_category
      @category.update!(category_params)

DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 1]]
---
  def destroy
    begin
      get_category
      @category.destroy!

SELECT  "categories".* FROM "categories" WHERE "categories"."vertical_id" = $1 AND "categories"."id" = $2 LIMIT $3  [["vertical_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def get_category
    @category = @vertical.categories.find params[:id]

SELECT  "verticals".* FROM "verticals" WHERE "verticals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def get_vertical
    begin
      @vertical = Vertical.find params[:vertical_id]