app/controllers/courses_controller.rb

  def create
    begin
      course = @category.courses.create! course_params
---
INSERT INTO "courses" ("name", "author", "category_id", "state", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "test course"], ["author", "test"], ["category_id", 6], ["state", 0], ["created_at", "2019-11-30 17:29:30.291802"], ["updated_at", "2019-11-30 17:29:30.291802"]]

  def update
    begin
      get_course
      @course.update!(course_params)
---
UPDATE "courses" SET "name" = $1, "state" = $2, "updated_at" = $3 WHERE "courses"."id" = $4  [["name", "test "], ["state", 1], ["updated_at", "2019-11-30 17:30:13.426183"], ["id", 1]]

  def destroy
    begin
      get_course
      @course.destroy!
---
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 1]]

  def get_course
    @course = @category.courses.find params[:id]
---
SELECT  "courses".* FROM "courses" WHERE "courses"."category_id" = $1 AND "courses"."id" = $2 LIMIT $3  [["category_id", 6], ["id", 1], ["LIMIT", 1]]

  def get_category
    begin
      @category = Category.find params[:category_id]
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]