app/controllers/verticals_controller.rb

SELECT  "verticals".* FROM "verticals" ORDER BY "verticals"."id" DESC LIMIT $1 OFFSET $2  [["LIMIT", 0], ["OFFSET", 2]]
---
  def index
    verticals = Vertical.all.paginate_records(params[:cursor], params[:size])

INSERT INTO "verticals" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test verticals"], ["created_at", "2019-11-30 13:28:06.024490"], ["updated_at", "2019-11-30 13:28:06.024490"]]
---
  def create
    begin
      vertical = Vertical.create! vertical_params

UPDATE "verticals" SET "name" = $1, "updated_at" = $2 WHERE "verticals"."id" = $3  [["name", "test 2"], ["updated_at", "2019-11-30 13:39:28.881297"], ["id", 2]]
---
  def update
    begin
      get_vertical
      @vertical.update!(vertical_params)

DELETE FROM "verticals" WHERE "verticals"."id" = $1  [["id", 1]]
---
  def destroy
    begin
      get_vertical
      @vertical.destroy!

SELECT  "verticals".* FROM "verticals" WHERE "verticals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def get_vertical
    @vertical = Vertical.find params[:id]