app/models/category.rb

  def check_overlapping_verticals
    vertical = Vertical.find_by_name(name)
---
SELECT  "verticals".* FROM "verticals" WHERE "verticals"."name" = $1 LIMIT $2  [["name", "test 10"], ["LIMIT", 1]]