app/models/vertical.rb

  def check_overlapping_categories
    category = Category.find_by_name(name)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT $2  [["name", "test vertical newww"], ["LIMIT", 1]]